In [1]:
import pandas as pd
import sqlite3

In [2]:
# Load CSV files into DataFrames
df1 = pd.read_csv('../Outputs/efficient_net_b7_model.csv')
df2 = pd.read_csv('../Outputs/inception_res_net_v2_model.csv')
df3 = pd.read_csv('../Outputs/mobile_net_model.csv')
df4 = pd.read_csv('../Outputs/vgg19_model.csv')
df5 = pd.read_csv('../Outputs/xception_model.csv')

In [3]:
# Create an SQLite database (in memory)
conn = sqlite3.connect(':memory:')

In [4]:
# Load DataFrames into SQLite tables
df1.to_sql('table1', conn, index=False, if_exists='replace')
df2.to_sql('table2', conn, index=False, if_exists='replace')
df3.to_sql('table3', conn, index=False, if_exists='replace')
df4.to_sql('table4', conn, index=False, if_exists='replace')
df5.to_sql('table5', conn, index=False, if_exists='replace')

5

In [9]:
# Write the SQL query to join the tables
query = '''
SELECT 
    t1.*, t2.*
FROM 
    table1 AS t1
JOIN 
    table2 AS t2
ON 
    t1.breed = t2.breed
'''

In [10]:
# Execute the SQL query and fetch the results into a DataFrame
result_df = pd.read_sql_query(query, conn)

In [11]:
# showing the results for efficient_net_b7_model.csv and inception_res_net_v2_model.csv
result_df.head()

                breed  prediction               breed  prediction
0   Yorkshire_terrier    0.707574   Yorkshire_terrier    0.790774
1  Australian_terrier    0.049668  Australian_terrier    0.026721
2       silky_terrier    0.046728       silky_terrier    0.035807
3         toy_terrier    0.012989         toy_terrier    0.012485

In [16]:
# renaming columns for clarification purposes
result_df.columns.values[1] = 'predictions_ENB7'
result_df.columns.values[3] = 'predictions_IRNV2'
result_df.head()

                breed  predictions_ENB7               breed  predictions_IRNV2
0   Yorkshire_terrier          0.707574   Yorkshire_terrier           0.790774
1  Australian_terrier          0.049668  Australian_terrier           0.026721
2       silky_terrier          0.046728       silky_terrier           0.035807
3         toy_terrier          0.012989         toy_terrier           0.012485

In [18]:
# joining more tables
query = '''
SELECT 
    t3.*, t2.*
FROM 
    table3 AS t3
JOIN 
    table2 AS t2
ON 
    t3.breed = t2.breed
'''
result_df = pd.read_sql_query(query, conn)
result_df.head()

                breed  prediction               breed  prediction
0   Yorkshire_terrier    0.970375   Yorkshire_terrier    0.790774
1       silky_terrier    0.014948       silky_terrier    0.035807
2         toy_terrier    0.010485         toy_terrier    0.012485
3  Australian_terrier    0.003030  Australian_terrier    0.026721

In [19]:
# trying a different approach to join all of the tables together
csv_paths= [
    '../Outputs/efficient_net_b7_model.csv',
    '../Outputs/inception_res_net_v2_model.csv',
    '../Outputs/mobile_net_model.csv',
    '../Outputs/vgg19_model.csv',
    '../Outputs/xception_model.csv'
]
dataframes = [pd.read_csv(file)for file in csv_paths]

combo_df = pd.concat(dataframes, ignore_index=True)
combo_df.head()

                breed  prediction
0   Yorkshire_terrier    0.707574
1  Australian_terrier    0.049668
2       silky_terrier    0.046728
3         toy_terrier    0.012989
4         Maltese_dog    0.005984